Repository: FunctionalSwift/final-app
Catalog: FunctionalTODOList/Resources/*.lproj/Localizable.strings
Languages: es

# task_title
source: Task
es: Tarea

# task_description
source: Description
es: Descripcion

# task_state
source: State
es: Estado

# task_expiration_date
source: Expiration
es: Día de expiración

# task_user_name
source: Assignee
es: Asignado a

# task_title_placeholder
source: Enter task title
es: Escribe un título para la tarea

# task_description_placeholder
source: Enter task description
es: Escribe una descripción para la tarea

# task_state_placeholder
source: Enter task state
es: Escribe el estado de la tarea

# task_expiration_date_placeholder
source: Enter task expiration date
es: Escribe la fecha de expiración

# task_user_name_placeholder
source: (Optional) Enter user name
es: (Opcional) Escribe el nombre de usuario

# task_scoped_title
source: Task Title
es: Titulo de la tarea

# task_scoped_state
source: Task State
es: Estado de la tarea

# task_scoped_user
source: User
es: Usuario

# tasks_completed_message
source: Completed Tasks: %@
es: Tareas completadas %@:

# tasks_in_progress_message
source: In progress Tasks: %@
es: Tareas en proceso %@:

# done_button_text
source: Done
es: Hecho

# project_description_text
source: Project Description
es: Descripción del Proyecto

# project_description_placeholder
source: Add Project description
es: Añade la descripción del Proyecto

# project_task_list_text
source: Select Project Tasks:
es: Selecciona las Tareas del Proyecto

# info_DeleteTask_alert_message
source: You can't delete a task that hasn't been previously stored.
es: No puedes eliminar una tarea que no ha sido almacenada previamente.

# info_AddTask_alert_message
source: All fields of the task must be filled in.
es: Todos los campos de la tarea son requeridos.

# info_DeleteProject_alert_message
source: You can't delete a project that hasn't been previously stored.
es: No puedes eliminar un proyecto que no ha sido almacenada previamente.

# info_AddProject_alert_message
source: All fields of Project must be filled in.
es: Todos los campos del proyecto son requeridos.

# error_AddTask_alert_message
source: An error occurred creating a task.
es: Ha ocurrido un error creando la tarea.

# error_TaskTitle_Too_Short
source: Task title should have more than 40 characters.
es: El título de la tarea debe tener más de 40 caracteres.

# error_TaskState_Incorrect
source: Task state incorrect.
es: El estado de la tarea incorrecto.

# error_UpdateTask_alert_message
source: An error occurred updating the task.
es: Ha ocurrido un error actualizando los datos de la tarea.

# error_DeleteTask_alert_message
source: An error occurred deleting the task.
es: Ha ocurrido un error eliminando los datos de la tarea.

# user_first_name
source: First Name
es: Nombre

# user_last_name
source: Last Name
es: Apellidos

# user_first_name_placeholder
source: Enter user first name
es: Escribe el nombre del usuario

# user_last_name_placeholder
source: Enter user last name
es: Escribe los apellidos del usuario

# error_task_title_too_short
source: Task title must be greater than 40 characters
es: El título de la tarea debe ser mayor a 40 caracteres

# error_task_unknown_state
source: Task state invalid, please enter valid state
es: Estado inválido, introduce un estado válido

# error_task_invalid_date
source: Task expiration must be after today
es: La fecha de expiración de la tarea debe ser posterior al día de hoy

# error_task_invalid_name
source: Task user name must be greater than 15 characters
es: El nombre del usuario asignado de la tarea debe ser mayor a 15 caracteres

# error_AddProject_alert_message
source: An error occurred creating a project.
es: Ha ocurrido un error creando el proyecto

# error_UpdateProject_alert_message
source: An error occurred updating the project.
es: Ha ocurrido un error actualizando los datos del proyeccto

# error_DeleteProject_alert_message
source: An error occurred deleting the project.
es: Ha ocurrido un error eliminando los datos del proyecto.

# error_project_description_too_short
source: Project description must be greater than 30 characters
es: La descripción del projecto debe ser mayor a 30 caracteres
